# Написать первую программу: программа должна выводить в консоль несколько строчек:
# ● Hello, World
# ● It is my first python program
# ● And it is the end of my program
# ● Bye-bye

print ('Hello, World')
print('It is my first python program')
print('And it is the end of my program')
print('Bye-bye')